Repository: joeloudjinz/inz_businessman
Catalog: lib/lang/l10n/intl_messages_*.arb
Languages: ar

# requiredError
source: This field is required
ar: هذه الخانة مطلوبه

# invalidEmailError
source: Email address is invalid
ar: البريد الإلكتروني غير صالح الهيئة

# passwordLengthError
source: Password must contain more then 5 characters
ar: كلمة السر يجب أن تكون أكثر من 5 حروف

# phoneZeroError
source: Phone number is invalid, it must start with 0
ar: رقم الهاتف غير صالح, يجب أن يبدأ بصفر 0

# phoneLengthError
source: Phone number is invalid, it must be 10 digits
ar: رقم الهاتف غير صالح, يجب أن يكون 10 أرقام

# codeLengthError
source: Verification code is invalid, it must be 6 digits
ar: الرمز غير صالح, يجب أن يكون 6 أرقام

# splashScreenTitle
source: Splash Screen
ar: صفحة البداية

# greetingCardBody
source: Welcome back dear businessman, the market really needs your deals & services.
ar: أهلا بك من جديد عزيزي رجل الأعمال ، السوق حقا بحاجة إلى صفقاتك وخدماتك.

# noAccountText
source: You don't have an account?
ar: لا تمتلك حساب؟

# startBusinessText
source: start your business from here
ar: إبدأ من هنا

# passwordLabel
source: Password
ar: كلمة السر

# emailLabel
source: Email
ar: البريد الإلكتروني

# loginButtonLabel
source: Login
ar: دخول

# phoneLabel
source: Phone
ar: رقم الهاتف

# verifyPhoneButtonLabel
source: Verify
ar: تأكيد

# agreementTextPart1
source: By clicking next, you agree to our
ar: بالضغط على تأكيد فإنك توافق على

# agreementTextPart2
source: and that you have read our
ar: و قد قرأت

source: Terms of service
ar: شروط الخدمة

source: Privacy policy
ar: سياسة الخصوصية.

# phoneRegistrationCardTitle
source: Phone Registration
ar: تسجيل الإشتراك

# phoneRegistrationCardBody
source: we start with your phone number, it is crucial for running your business smoothly so make sure to provide a valid one.
ar: نبدأ برقم هاتفك ، إنه أمر بالغ الأهمية لإدارة عملك بسلاسة ، لذا تأكد من تقديم رقم صالح.

# phoneVerificationCardTitle
source: Phone Verification
ar: تأكيد رقم الهاتف

# phoneVerificationCardBody
source: Enter the 6 digits you received in the SMS. if you didn't receive the code click resend.
ar: أدخل ستة أرقام التي وصلت عبر الرسالة, إن لم تصلك إضغط على إعادة الإرسال.

# verificationCodeLabel
source: Code
ar: الرمز

# nextButtonLabel
source: Verify
ar: تأكد

# resendButtonLabel
source: Resend
ar: إعادة الإرسال

# fullNameLabel
source: Full Name
ar: الإسم الكامل

# secondRegistrationCardTitle
source: Final Registration
ar: اللمسات الأخيرة

# secondRegistrationCardBody
source: The final step at this journey, provide the necessary information about you and you are ready to grow your business.
ar: في الأخير أدخل معلوماتك الشخصية و ستكون جاهزاً لبدء أعمالك.

# submitButtonLabel
source: Let's go
ar: هيا بنا
